#pandas

In [2]:
import pandas as pd

In [2]:
print(pd. __version__)

1.3.2

In [3]:
arr =[0,1,2,3,4]
s1= pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [4]:
order=[1,2,3,4,5]
pd.Series(arr, index=order)

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [5]:
import numpy as np
n=np.random.randn(5)
index =['a','b','c','d','e']
s2 =pd.Series(n, index=index)
s2

a    0.155481
b    0.017341
c    1.365899
d   -0.212579
e    0.180281
dtype: float64

In [6]:
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [7]:
s1.index=['A','B','C','D','E']
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [8]:
s1[:2]

A    0
B    1
dtype: int64

In [9]:
s4=s1.append(s1)
s4

A    0
B    1
C    2
D    3
E    4
A    0
B    1
C    2
D    3
E    4
dtype: int64

In [10]:
s4.drop('E')

A    0
B    1
C    2
D    3
A    0
B    1
C    2
D    3
dtype: int64

SERIES OPERATIONS

In [11]:
arr1=[1,2,3,4,5,7]
arr2=[6,7,8,9,5]

In [12]:
s5=pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [13]:
s6=pd.Series(arr1)
s6

0    1
1    2
2    3
3    4
4    5
5    7
dtype: int64

In [14]:
s5.add(s6)

0     7.0
1     9.0
2    11.0
3    13.0
4    10.0
5     NaN
dtype: float64

In [15]:
s5.sub(s6)

0    5.0
1    5.0
2    5.0
3    5.0
4    0.0
5    NaN
dtype: float64

In [16]:
s5.mul(s6)

0     6.0
1    14.0
2    24.0
3    36.0
4    25.0
5     NaN
dtype: float64

In [17]:
s5.div(s6)

0    6.000000
1    3.500000
2    2.666667
3    2.250000
4    1.000000
5         NaN
dtype: float64

In [18]:
s6.median()

3.5

In [19]:
print("max",s6.max())

max 7

CREATING DATAFRAME

In [20]:
dates=pd.date_range('today',periods=6)
num_arr=np.random.randn(6,4)
columns=['A','B','C','D']
df1=pd.DataFrame(num_arr,index=dates, columns=columns)

df1

                                   A         B         C         D
2021-09-23 13:15:13.978718 -0.874349  0.008403  0.728965  0.782906
2021-09-24 13:15:13.978718  0.268597  0.985078  0.048878 -0.342752
2021-09-25 13:15:13.978718  0.377973  1.928581 -0.290180 -0.227852
2021-09-26 13:15:13.978718  1.830269 -1.972441  1.145906  0.827699
2021-09-27 13:15:13.978718 -0.559633  0.853994  0.847952  1.499244
2021-09-28 13:15:13.978718 -0.240014 -1.540929 -0.650111 -2.628461

In [21]:
data = {'animals' :['cat','paka'],
       'height': [10,20]}
labels=['a','b']

df2=pd.DataFrame(data, index=labels)
df2

  animals  height
a     cat      10
b    paka      20

In [22]:
df2.dtypes

animals    object
height      int64
dtype: object

In [23]:
df2.head(1)

  animals  height
a     cat      10

In [24]:
df3.columns

NameError: name 'df3' is not defined

In [ ]:
df2.values

In [25]:
df2.describe()

          height
count   2.000000
mean   15.000000
std     7.071068
min    10.000000
25%    12.500000
50%    15.000000
75%    17.500000
max    20.000000

In [26]:
df2.to_csv("dta.csv")

In [27]:
df2.T

           a     b
animals  cat  paka
height    10    20

In [28]:
df2.shape

(2, 2)

In [29]:
df2.sort_values(by='height')

  animals  height
a     cat      10
b    paka      20

In [30]:
df2[1:2]

  animals  height
b    paka      20

In [33]:
df2.iloc[0:1]

  animals  height
a     cat      10

In [34]:
df3=df2.copy()

In [35]:
df3

  animals  height
a     cat      10
b    paka      20

In [36]:
df3.isnull()

   animals  height
a    False   False
b    False   False

In [40]:
df3.loc['d','height']=370
df3

  animals  height
a     cat   300.0
b    paka    20.0
1     NaN   300.0
c     NaN   300.0
d     NaN   370.0

In [41]:
df3

  animals  height
a     cat   300.0
b    paka    20.0
1     NaN   300.0
c     NaN   300.0
d     NaN   370.0

In [42]:
df3.isnull()

   animals  height
a    False   False
b    False   False
1     True   False
c     True   False
d     True   False

In [43]:
df3.mean()

C:\Users\JASTYN\AppData\Local\Temp/ipykernel_2816/3891983329.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.mean()

height    258.0
dtype: float64

In [47]:
df3.sum()

NameError: name 'height' is not defined

In [3]:
df4 = pd.read_csv("winemag-data-130k-v2.csv")

In [4]:
df4

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
1,1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
129966,129966,Germany,Notes of honeysuckle and cantaloupe sweeten th...,Brauneberger Juffer-Sonnenuhr Spätlese,90,28.0,Mosel,NaN,NaN,Anna Lee C. Iijima,NaN,Dr. H. Thanisch (Erben Müller-Burggraef) 2013 ...,Riesling,Dr. H. Thanisch (Erben Müller-Burggraef)
129967,129967,US,Citation is given as much as a decade of bottl...,NaN,90,75.0,Oregon,Oregon,Oregon Other,Paul Gregutt,@paulgwine,Citation 2004 Pinot Noir (Oregon),Pinot Noir,Citation
129968,129968,France,Well-drained gravel soil gives this wine its c...,Kritt,90,30.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Gresser 2013 Kritt Gewurztraminer (Als...,Gewürztraminer,Domaine Gresser
129969,129969,France,"A dry style of Pinot Gris, this is crisp with ...",NaN,90,32.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Marcel Deiss 2012 Pinot Gris (Alsace),Pinot Gris,Domaine Marcel Deiss
129970,129970,France,"Big, rich and off-dry, this is powered by inte...",Lieu-dit Harth Cuvée Caroline,90,21.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Schoffit 2012 Lieu-dit Harth Cuvée Car...,Gewürztraminer,Domaine Schoffit

In [5]:
df4.describe()

          Unnamed: 0         points          price
count  129971.000000  129971.000000  120975.000000
mean    64985.000000      88.447138      35.363389
std     37519.540256       3.039730      41.022218
min         0.000000      80.000000       4.000000
25%     32492.500000      86.000000      17.000000
50%     64985.000000      88.000000      25.000000
75%     97477.500000      91.000000      42.000000
max    129970.000000     100.000000    3300.000000

In [3]:
string = pd.Series(["A","B"])
string.str.lower()

0    a
1    b
dtype: object

In [4]:
string.str.upper()

0    A
1    B
dtype: object

OPERATION FOR MISSING VALUES

In [5]:
df4 = pd.read_csv("winemag-data-130k-v2.csv")

In [6]:
df4.describe()

          Unnamed: 0         points          price
count  129971.000000  129971.000000  120975.000000
mean    64985.000000      88.447138      35.363389
std     37519.540256       3.039730      41.022218
min         0.000000      80.000000       4.000000
25%     32492.500000      86.000000      17.000000
50%     64985.000000      88.000000      25.000000
75%     97477.500000      91.000000      42.000000
max    129970.000000     100.000000    3300.000000

In [7]:
df5=df4.copy()

# Dropping missing values

In [9]:
df5.dropna(how='any')

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks
10,10,US,"Soft, supple plum envelopes an oaky structure ...",Mountain Cuvée,87,19.0,California,Napa Valley,Napa,Virginie Boone,@vboone,Kirkland Signature 2011 Mountain Cuvée Caberne...,Cabernet Sauvignon,Kirkland Signature
23,23,US,This wine from the Geneseo district offers aro...,Signature Selection,87,22.0,California,Paso Robles,Central Coast,Matt Kettmann,@mattkettmann,Bianchi 2011 Signature Selection Merlot (Paso ...,Merlot,Bianchi
25,25,US,Oak and earth intermingle around robust aromas...,King Ridge Vineyard,87,69.0,California,Sonoma Coast,Sonoma,Virginie Boone,@vboone,Castello di Amorosa 2011 King Ridge Vineyard P...,Pinot Noir,Castello di Amorosa
35,35,US,As with many of the Erath 2010 vineyard design...,Hyland,86,50.0,Oregon,McMinnville,Willamette Valley,Paul Gregutt,@paulgwine,Erath 2010 Hyland Pinot Noir (McMinnville),Pinot Noir,Erath
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
129919,129919,US,"This ripe, rich, almost decadently thick wine ...",Reserve,91,105.0,Washington,Walla Walla Valley (WA),Columbia Valley,Paul Gregutt,@paulgwine,Nicholas Cole Cellars 2004 Reserve Red (Walla ...,Red Blend,Nicholas Cole Cellars
129926,129926,US,This pure Syrah from Reininger's estate vineya...,Ash Hollow Vineyard,91,41.0,Washington,Walla Walla Valley (WA),Columbia Valley,Paul Gregutt,@paulgwine,Reininger 2005 Ash Hollow Vineyard Syrah (Wall...,Syrah,Reininger
129945,129945,US,Hailing from one of the more popular vineyards...,Jurassic Park Vineyard Old Vines,90,20.0,California,Santa Ynez Valley,Central Coast,Matt Kettmann,@mattkettmann,Birichino 2013 Jurassic Park Vineyard Old Vine...,Chenin Blanc,Birichino
129949,129949,US,There's no bones about the use of oak in this ...,Barrel Fermented,90,35.0,California,Napa Valley,Napa,Virginie Boone,@vboone,Flora Springs 2013 Barrel Fermented Chardonnay...,Chardonnay,Flora Springs
129950,129950,US,This opens with herbaceous dollops of thyme an...,Blocks 7 & 22,90,35.0,California,Napa Valley,Napa,Virginie Boone,@vboone,Hendry 2012 Blocks 7 & 22 Zinfandel (Napa Valley),Zinfandel,Hendry